# EDUNET FOUNDATION- Self Paced Exercise Solution Notebook

# Lab - 1 Self Paced Exercise Solution

# Dataset:
- train.csv
- test.csv

# Problem Statement 
- For the Titanic challenge we need to guess wheter the individuals from the test dataset had survived or not.

# Import necessary modules

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn import preprocessing
from sklearn.model_selection import train_test_split

# Loading data

In [2]:
dataset_train=pd.read_csv("train.csv")
dataset_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:

dataset_test=pd.read_csv("test.csv")
dataset_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

# checking Null values

In [4]:
dataset_train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [5]:
dataset_test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [6]:
dataset_train.shape

(891, 12)

In [7]:
dataset_test.shape

(418, 11)

# Data Pre-processing

In [8]:
df_train=dataset_train.fillna(method="ffill")#fill the null values

In [9]:
df_test=dataset_test.fillna(method="ffill")

In [10]:
df_train.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          1
Embarked       0
dtype: int64

In [11]:
df_test.isnull().sum()

PassengerId     0
Pclass          0
Name            0
Sex             0
Age             0
SibSp           0
Parch           0
Ticket          0
Fare            0
Cabin          12
Embarked        0
dtype: int64

In [12]:
df_train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,891.00000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.58156,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.55459,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.42000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.00000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.00000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.00000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.00000,8.000000,6.000000,512.329200

In [13]:
df_test.describe()

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   418.000000  418.000000  418.000000  418.000000  418.000000  418.000000
mean   1100.500000    2.265550   30.125000    0.447368    0.392344   35.560845
std     120.810458    0.841838   13.905601    0.896760    0.981429   55.856972
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   22.000000    0.000000    0.000000    7.895800
50%    1100.500000    3.000000   27.000000    0.000000    0.000000   14.454200
75%    1204.750000    3.000000   39.000000    1.000000    0.000000   31.471875
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200

# label Encoding

In [14]:
label_encoder=preprocessing.LabelEncoder()

df_train['Pclass_type']=label_encoder.fit_transform(df_train["Pclass"])
df_train['Age_type']=label_encoder.fit_transform(df_train["Age"])
df_train['SibSp_type']=label_encoder.fit_transform(df_train["SibSp"])
df_train['Parch_type']=label_encoder.fit_transform(df_train["Parch"])
df_train['Fare_type']=label_encoder.fit_transform(df_train["Fare"])
df_train['Embarked_type']=label_encoder.fit_transform(df_train["Embarked"])
df_train['Sex_type']=label_encoder.fit_transform(df_train["Sex"])

In [15]:
label_encoder=preprocessing.LabelEncoder()

df_test['Pclass_type']=label_encoder.fit_transform(df_test["Pclass"])
df_test['Age_type']=label_encoder.fit_transform(df_test["Age"])
df_test['SibSp_type']=label_encoder.fit_transform(df_test["SibSp"])
df_test['Parch_type']=label_encoder.fit_transform(df_test["Parch"])
df_test['Fare_type']=label_encoder.fit_transform(df_test["Fare"])
df_test['Embarked_type']=label_encoder.fit_transform(df_test["Embarked"])
df_test['Sex_type']=label_encoder.fit_transform(df_test["Sex"])

# Delete unnecessary Columns(Features)

In [22]:
del df_train['PassengerId']
del df_train['Pclass']
del df_train['Age']
del df_train['Name']
del df_train['SibSp']
del df_train['Cabin']
del df_train['Parch']
del df_train['Fare']
del df_train['Ticket']
del df_train['Sex']
del df_train['Embarked']

KeyError: 'PassengerId'

In [25]:
del df_test['PassengerId']
del df_test['Pclass']
del df_test['Age']
del df_test['Name']
del df_test['SibSp']
del df_test['Cabin']
del df_test['Parch']
del df_test['Fare']
del df_test['Ticket']
del df_test['Sex']
del df_test['Embarked']

In [23]:
df_train.head()

,Survived,Pclass_type,Age_type,SibSp_type,Parch_type,Fare_type,Embarked_type,Sex_type
0,0,2,28,1,0,18,2,1
1,1,0,51,1,0,207,0,0
2,1,2,34,0,0,41,2,0
3,1,0,47,1,0,189,2,0
4,0,2,47,0,0,43,2,1

In [26]:
df_test.head()

,Pclass_type,Age_type,SibSp_type,Parch_type,Fare_type,Embarked_type,Sex_type
0,2,44,0,0,24,1,1
1,2,60,1,0,5,2,0
2,1,74,0,0,41,1,1
3,2,34,0,0,34,2,1
4,2,27,1,1,46,2,0

# Split into training and test set

In [27]:
#split the data into x and y
x=df_train[['Pclass_type', 'Age_type', 'SibSp_type','Parch_type', 'Fare_type', 'Embarked_type', 'Sex_type']]

y=df_train[['Survived']]

In [28]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.3)

# scaling of X (train and test data)

In [29]:
from sklearn.preprocessing import StandardScaler
scaler=StandardScaler()
scaled = scaler.fit_transform(df_train)


x_train_scaled = scaler.fit_transform(x_train) 
x_test_scaled=scaler.transform(x_test)
print("Mean value:",x_train_scaled.mean(axis=0))
print("SD value:",x_train_scaled.std(axis=0))

Mean value: [ 1.12626156e-16  1.45416049e-16  2.28103607e-17 -1.99590656e-17
  3.56411886e-17  4.84720165e-17  3.56411886e-17]
SD value: [1. 1. 1. 1. 1. 1. 1.]

# Model selection and implimentation

In [30]:
from sklearn import tree
clf= tree.DecisionTreeClassifier()
clf= clf.fit(x_train_scaled,y_train)

# Accuracy Check

In [31]:
clf.score(x_test_scaled,y_test)*100

76.49253731343283